<?php

namespace RandomNepaliQuotes;

class QuoteGenerator
{
    protected $quotes = [
        "यदि जीवन पुर्वानुमान गर्न सकिन्थ्यो भने यो जीवन रहन बन्द हुन्थ्यो, र विना स्वादको हुन्थ्याे ।",
        "यो सपना र जिन्दगीमा फोकस गरेर बाच्न बिर्सनु हुँदैन ।",
        "जब तपाईं आफ्नो डोरीको अन्तमा पुग्नुहुन्छ, एउटा गाँठ बाँध्नुहोस् र पर्खनुहोस् ।",
        "भविष्य तिनीहरूकै हो जसले आफना सपनाहरूको सुन्दरतामा विश्वास गर्छन् ।",
        "जीवन त्यो नै हो, हाम्रो जीवनमा घटछ, जब हामी अन्य योजनाहरू बनाइरहेका हुन्छौं ।",
        "यो हाम्रो अन्धकारमय क्षणहरू मा नै हामीले प्रकाश हेन ध्यान केन्द्रित गर्नुपर्दछ । - एरिस्टोटल"
    ];

    public function getRandonQuote(): string
    {
        return $this->quotes[array_rand($this->quotes)];
    }
}
